selenium/feature_tests/src/test/resources/testfiles/genricReportingUAE/dispatchFailure.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:cxf="http://cxf.component.camel.apache.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <n1:envelope
                xmlns:n1="http://www.sap.com/sap_ich4ls/"
                xmlns:prx="urn:sap.com:proxy:Y21:/1SAI/TAS8FB8FF2B37F00B51AA2D:740"
                xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
            <message date="2022-09-29" time="07:53:37">
                <id>42010AEECDE11EDD84B2F89B99FA27AB</id>
            </message>
            <sender agency="GS1" scheme="GLN">0355801000002</sender>
            <recipients>
                <id agency="SAP" scheme="RegReport">RR_SA_ICH_DISPATCH</id>
            </recipients>
            <content encoding="XML" format="ATTP" type="GenericReporting" version="1.0">
                <ATTPGRDocument>
                    <GRHeader>
                        <GRHeaderBase>
                            <ReceiverId>RR_SA_ICH_DISPATCH</ReceiverId>
                            <InstanceId>42010AEECDE11EDD84B2F89B99FA27AB</InstanceId>
                            <DateTime>2022-08-01T12:45:05Z</DateTime>
                            <VariantName>RR_SA_DISPATCH</VariantName>
                            <VariantVersion>1</VariantVersion>
                        </GRHeaderBase>
                        <ContentList>
                            <Content type="BusinessPartner">
                                <ContentItem id="92-ICH: Saudi Arabia CUST 1"
                                             selectionMethod="DestLocGLN">
                                    <ContentItemSection type="Details">
                                        <ContentItemSectionItem>
                                            <attribute id="sttpBupBupGln">4063973002996</attribute>
                                        </ContentItemSectionItem>
                                    </ContentItemSection>
                                </ContentItem>
                            </Content>
                        </ContentList>
                    </GRHeader>
                    <GRBody>
                        <ObjContentList>
                            <ObjContent type="LotRefList">
                                <ObjContentGroup>
                                    <ObjCode id="010406397300010010DKSA010801"
                                             type="LGTIN"
                                             dateManuf="2022-09-15"
                                             dateExp="2021-08-01"/>
                                </ObjContentGroup>
                            </ObjContent>
                            <ObjContent type="SGTINList">
                                <ObjContentGroup>
                                    <ObjCode id="0104063973000100210C125O34TYK"
                                             type="SGTIN"
                                             lotRef="DKSA010801"/>
                                    <ObjCode id="objcode2" type="SGTIN" lotRef="SFDAQOSAIBI1810" />
                                </ObjContentGroup>
                            </ObjContent>
                        </ObjContentList>
                    </GRBody>
                </ATTPGRDocument>
            </content>
        </n1:envelope>
    </soapenv:Body>
</soapenv:Envelope>